FullCircle-backend/FullCircle/app/views/electrical/electrical.html.erb

<body>
  <% Resource.all.each do |resource| %>
---
SELECT "resources".* FROM "resources"