FullCircle/app/views/mechanical/mechanical.html.erb

<body>
  <% Resource.all.each do |resource| %>
---
SELECT "resources".* FROM "resources"