FullCircle-backend/FullCircle/app/views/awards/awards.html.erb

  <p></p>
  <% Resource.all.each do |resource| %>
---
SELECT "resources".* FROM "resources"