FullCircle/app/views/programming/programming.html.erb

        </h4>
        <% Resource.all.each do |resource| %>
---
SELECT "resources".* FROM "resources"