FullCircle-backend/FullCircle/app/views/programming/programming.html.erb

<body>
  <% Resource.all.each do |resource| %>
---
SELECT "resources".* FROM "resources"