FullCircle-backend/FullCircle/app/views/outreach/outreach.html.erb

SELECT "resources".* FROM "resources"
---
<body>
  <% Resource.all.each do |resource| %>