FullCircle-backend/FullCircle/app/controllers/download_controller.rb

  def download_file
    id = params[:id].to_i
    resource = Resource.find_by_id id
---
SELECT  "resources".* FROM "resources" WHERE "resources"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def preview_file
    id = params[:id].to_i
    resource = Resource.find_by_id id
---
SELECT  "resources".* FROM "resources" WHERE "resources"."id" = ? LIMIT ?  [["id", 38], ["LIMIT", 1]]