FullCircle-backend/FullCircle/app/controllers/process_controller.rb

  def process_resource
    @resource = Resource.new
    # Instance of UploadedFile classes
    # http://api.rubyonrails.org/classes/ActionDispatch/Http/UploadedFile.html#method-i-read
    uploaded_file = params["Resource"][:file]
    description = params[:description]
    # render plain: uploaded_file.original_filename
    @resource.filename = uploaded_file.original_filename
    # ETC...
    @resource.type_of_resource = params[:type_of_resource]
    @resource.data = uploaded_file.read
    @resource.content_type = uploaded_file.content_type
    @resource.description = description
    @resource.save
---
INSERT INTO "resources" ("filename", "content_type", "data", "created_at", "updated_at", "type_of_resource", "description", "basename") VALUES (?, ?, ?, ?, ?, ?, ?, ?)